{
  "reviews": [
    {
      "username": "Asis B.",
      "role": "Software Development Engineer",
      "companySize": "Small-Business(50 or fewer emp.)",
      "rating": 8,
      "date": "Dec 17, 2023",
      "title": "\"Best Non db content management system\"",
      "description": "What do you like best about Pulse?It's a easy to use CMS I personally like things to be fast and easy and it's non coding features and template made my life so easy Review collected by and hosted on G2.com.What do you dislike about Pulse?Price point as it not self hosted I feel it's a bit expensive Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?It helps me to build website with just a few clicks, it saves my time and helps me build good website with their templates Review collected by and hosted on G2.com."
    },
    {
      "username": "Sheheryar A.",
      "role": "Test Automation Consultant",
      "companySize": "Small-Business(50 or fewer emp.)",
      "rating": 9,
      "date": "Dec 14, 2023",
      "title": "\"Great Content management System\"",
      "description": "What do you like best about Pulse?Hosting is simple by using pulse, as the user interface creates ease for generating content. Also they have guidance to be informative Review collected by and hosted on G2.com.What do you dislike about Pulse?It is difficult to mention anything that i didn't like about Pulse, but sometimes it takes a lot of time to load. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?I needed a website to built easily, hence started using pulse. Everything was so smooth that i could create my website easily. Will recommend pulse to everyone Review collected by and hosted on G2.com."
    },
    {
      "username": "Ram L.",
      "role": "SEO Executive",
      "companySize": "Small-Business(50 or fewer emp.)",
      "rating": 10,
      "date": "Dec 05, 2023",
      "title": "\"Amazing CMS Platform For Website Designers\"",
      "description": "What do you like best about Pulse?I like the best thing is Pulse have many types of features. Pulse CRM is easy to use anyone can learn easily and do work. Best designs and features are available. Review collected by and hosted on G2.com.What do you dislike about Pulse?Perhaps the platform might be accessible on a mobile device. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?It helps me to create website for myself and i manged my website with the help of pulse easily as well. Review collected by and hosted on G2.com."
    },
    {
      "username": "Akshay S.",
      "role": "Module Lead",
      "companySize": "Small-Business(50 or fewer emp.)",
      "rating": 10,
      "date": "Sep 17, 2023",
      "title": "\"Best CMS tool\"",
      "description": "What do you like best about Pulse?1. Best in static content generator.\n2. Track readers different matrics.\n3. Host website is simple by using this.\n4. User interface is easy to understand.\n5. Guide tour is impressive and very informative. Review collected by and hosted on G2.com.What do you dislike about Pulse?1. Processing take on long time to produce the result.\n3. Mobile app or easy to reachable platform should be available.\n\nApart from this I didn't found any thing that user should dilike. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?Static web content and website creation is too easy by minimal user efforts. I would highly suggest and recommended this to use atleast once before using another one. Review collected by and hosted on G2.com."
    },
    {
      "username": "Michael N.",
      "role": "Chief Information Officer",
      "companySize": "Mid-Market(51-1000 emp.)",
      "rating": 8,
      "date": "Dec 05, 2023",
      "title": "\"pusle works the way it is supposed to work and it is very intuitive with the user interface.\"",
      "description": "What do you like best about Pulse?very easy to learn nd use\nvery intutive,\nvery powerfull.\nHas several important standrd reports Review collected by and hosted on G2.com.What do you dislike about Pulse?It does not allow you to log in simultaneoulsy from 2 different machines Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?it allowed us to medernise our website.\nit allows the users to change conent on the website without the need of a developer. Review collected by and hosted on G2.com."
    },
    {
      "username": "Rajesh S.",
      "role": "Marketing Consultant",
      "companySize": "Mid-Market(51-1000 emp.)",
      "rating": 9,
      "date": "May 14, 2022",
      "title": "\"Awesome Management by Pulse\"",
      "description": "What do you like best about Pulse?Pulse is a tool that I've been using for some time now and it's purpose is to help me with content management. It's a static site generator that is really easy to use. I like how simple it is to write posts and how you can make it your own. I also like that I can use it to track different metrics and have a pulse on what my readers like. What I like about it the best is that there is an app for it. It's made it so much easier for me to keep on top of my content. It's a great tool for managing content and delivering it quickly and easily to my readers. Review collected by and hosted on G2.com.What do you dislike about Pulse?Its handling was slow contrasted with another stage and take extremely lengthy stacking time. I would agree that a portion of the formats can be somewhat interesting, however other than that, it is astounding to utilize. Review collected by and hosted on G2.com.Recommendations to others considering Pulse:I incorporate heartbeat a few devices for market figures search. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?The most serious issue that I am addressing with a heartbeat is that I want assistance following things all the more proficiently, and right now, I was not doing that, yet since utilizing it, I understood how it has been making my life way simpler. Review collected by and hosted on G2.com."
    },
    {
      "username": "Verified User in Information ServicesInformation",
      "role": "Small-Business(50 or fewer emp.)",
      "rating": 8,
      "date": "Oct 12, 2022(Original Aug 08, 2022)Information",
      "title": "\"Pulse CM Review\"",
      "description": "What do you like best about Pulse?Simple and able to do self hosted websites or shared hosted Review collected by and hosted on G2.com.What do you dislike about Pulse?Nothing solid comes to mind. Some tools can be desireable Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?Technical skill requirement is shallow. Can customize Review collected by and hosted on G2.com."
    },
    {
      "username": "Neelesh N.",
      "role": "Senior Software Engineer",
      "companySize": "Enterprise(> 1000 emp.)",
      "rating": 10,
      "date": "Apr 21, 2022",
      "title": "\"Pulse review\"",
      "description": "What do you like best about Pulse?Pulse is easy to use, fast and user friendly Review collected by and hosted on G2.com.What do you dislike about Pulse?Some glitches are there while submitting the survey request Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?Ready to work things can be solved with pulse Review collected by and hosted on G2.com."
    },
    {
      "username": "vinesh r.",
      "role": "Site Inspector",
      "companySize": "Mid-Market(51-1000 emp.)",
      "rating": 7,
      "date": "Mar 31, 2022",
      "title": "\"Review\"",
      "description": "What do you like best about Pulse?Track of work and well organized, comfort in use easy in understanding Review collected by and hosted on G2.com.What do you dislike about Pulse?procesing was slow compared to other platform , loading taking time Review collected by and hosted on G2.com.Recommendations to others considering Pulse:Yes Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?Management process Review collected by and hosted on G2.com."
    },
    {
      "username": "Raveena J.",
      "role": "Business Development Representative",
      "companySize": "Mid-Market(51-1000 emp.)",
      "rating": 9,
      "date": "May 25, 2021",
      "title": "\"Pulse review\"",
      "description": "What do you like best about Pulse?I like that you can use it to track different metrics, and it is motivating to want to use it daily. I enjoy having it, and the fact that there is an app for it is excellent. Pulse did make the transition into building things much easier for my team and me Review collected by and hosted on G2.com.What do you dislike about Pulse?There isn't much that I dislike about this product. If anything, it has made my life a bit easier. I would say that some of the layouts can be a little tricky, but other than that, it is excellent to use. Review collected by and hosted on G2.com.Recommendations to others considering Pulse:I think it is definitely something that people can use and I would fully tell them to give it a shot. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?I think the biggest problem that I am solving with a pulse is that I need help tracking things more efficiently, and at the moment, I was not doing that, but since using it, I realized how it has been making my life way easier. Review collected by and hosted on G2.com."
    },
    {
      "username": "Iraj A.",
      "role": "PhD in Materials Engineering",
      "companySize": "Enterprise(> 1000 emp.)",
      "rating": 9,
      "date": "May 26, 2021",
      "title": "\"Pulse\"",
      "description": "What do you like best about Pulse?I found the product tour that appears when you first use the tool to be useful and informative. The other element is the site's simplicity in Design, which makes it very easy to explore the platform. Also includes several tools for market figures search. Review collected by and hosted on G2.com.What do you dislike about Pulse?Pulse is a unique software; hence its database does not have many of the organizations, I am searching for, especially those that are based in (MENA) The region of the Middle East and North Africa that traditionally held close ties to Europe. Review collected by and hosted on G2.com.Recommendations to others considering Pulse:I include pulse several tools for market figures search. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?Despite from the software’s, Pulse not only whole dataset is for productions, but it also provides me with a lot of important information and eliminates the speculation for better work. Review collected by and hosted on G2.com."
    },
    {
      "username": "Yasmin D.",
      "role": "Customer Experience Assistant",
      "companySize": "Mid-Market(51-1000 emp.)",
      "rating": 10,
      "date": "Jun 04, 2021(Original May 31, 2021)Information",
      "title": "\"Very good platform for evaluating the well-being inside the company\"",
      "description": "What do you like best about Pulse?The framework that was buit is intuitive and easy to control. Review collected by and hosted on G2.com.What do you dislike about Pulse?Maybe the platform could be present on cellphone. Review collected by and hosted on G2.com.Recommendations to others considering Pulse:Great way to check if your company is going well, counting on periodic inner surveys. Review collected by and hosted on G2.com.What problems is Pulse solving and how is that benefiting you?I'm solving problems of performance inside of the company, having improvement of our well--being as employees and guaranteeing the organization fits in the benchmark. Review collected by and hosted on G2.com."
    }
  ]
}